// task 1:
const max1 = 20;
let str = '';

for (let i = 10; i <= max1; i++) {
    str += `${i}`;
    if (i !== max1) {
        str += ', ';
    }
};

console.log(`Числа від 10 до 20: ${str}`);

//=================================================================================================
//task 2:
const max2 = 20;
let squares = '';

for (let i = 10; i <= max2; i++) {
    squares += `${i * i}`;
    if (i !== max2) {
        squares += ', ';
    }
};

console.log(`Квадрати чисел від 10 до 20: ${squares}`);

//=================================================================================================
//task 3:
const num = 7;
let iterator = 1;

console.log(`Таблиця множення на ${num}:`);

while (iterator <= 10) {
    console.log(`${num} * ${iterator} = ${num * iterator}`);
    iterator++;
};

//=================================================================================================
//task 4:
const max3 = 15;
let sum1 = 0;

for (let i = 1; i <= max3; i++) {
    sum1 += i;
}

console.log(`Сума всіх цілих чисел від 1 до 15 = ${sum1}`);

//=================================================================================================
//task 5:
const max4 = 35;
let mult = 1;

for (let i = 15; i <= max4; i++) {
    mult *= i;
}

console.log(`Добуток усіх цілих чисел від 15 до 35 = ${mult}`);

//=================================================================================================
//task 6:
const max5 = 500;
let sum2 = 0;
let count1 = 0; //рахує загальну кількість значень

for (let i = 1; i <= max5; i++) {
    sum2 += i;
    count1++;
}

console.log(`Середнє арифметичне всіх цілих чисел від 1 до 500 = ${sum2 / count1}`);

//=================================================================================================
// task 7:
const max6 = 80;
let sum3 = 0;

for (let i = 30; i <= max6; i++) {
    if(i % 2 == 0) {
        sum3 += i;
    }
}

// another way:
// for (let i = 30; i <= max6; i += 2) {
//     sum3 += i;
// }

console.log(`Сума лише парних чисел в діапазоні від 30 до 80 = ${sum3}`);

//=================================================================================================
//task 8:
const max7 = 200;
let divis = '';

for (let i = 100; i <= max7; i++) {
    if(i % 3 == 0) {
        divis += `${i}, `;
    }
}

const divisible = divis.slice(0, -2);
console.log(`Числа в діапазоні від 100 до 200, які кратні 3: ${divisible}`);

//=================================================================================================
//task 9, 10, 11:
const number = 8;
let divisors = '';
let count2 = 0;
let sum4 = 0;

for (let i = 1; i <= number; i++) {
    if (number % i == 0) {
        divisors += `${i}, `;
        if (i % 2 == 0) {
            count2++;
            sum4 += i;
        }
    }
}  

const divisorsAll = divisors.slice(0, -2);
console.log(`Всі дільники числа ${number}: ${divisorsAll}`);

console.log(`Кількість парних дільників: ${count2}`);

console.log(`Сума парних дільників = ${sum4}`);

//=================================================================================================
//task 12:
for (let i = 1; i <= 10; i++) {
    console.log(`Таблиця множення на ${i}:`);
    for (let x = 1; x <= 10; x++) {
        console.log(`${x} * ${i} = ${i * x}`);
    }
    console.log("");
}